eisup_2019_docmng_integration/src/InformationRegisters/СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам/СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПостановкаНаУчетВНалоговомОргане</name>
    <type>
      <types>EnumRef.ПостановкаНаУчетВНалоговомОргане</types>
    </type>
  </resources>
  <resources>
    <name>НалоговыйОрган</name>
    <type>
      <types>CatalogRef.РегистрацияВИФНС</types>
    </type>
  </resources>
  <resources>
    <name>ПорядокНалогообложения</name>
    <type>
      <types>EnumRef.ПорядокНалогообложенияИмущества</types>
    </type>
  </resources>
  <resources>
    <name>НалоговаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодНалоговойЛьготыОсвобождениеОтНалогообложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СниженнаяНалоговаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьВходитВСоставЕСГС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьРасположенВРазныхСубъектахФедерации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДоляСтоимостиЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоляСтоимостиЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВидИмущества</name>
    <type>
      <types>EnumRef.ВидыИмущества</types>
    </type>
  </resources>
  <resources>
    <name>НалоговаяБаза</name>
    <type>
      <types>EnumRef.НалоговаяБазаПоНалогуНаИмущество</types>
    </type>
  </resources>
  <resources>
    <name>КадастроваяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУменьшенияНалоговойБазы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПоОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КодПоОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/ВидыИмущества/ВидыИмущества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыИмущества</name>
  <enumValues>
    <name>ОсобенностиОтсутствуют</name>
  </enumValues>
  <enumValues>
    <name>ВходитВСоставЕСГС</name>
  </enumValues>
  <enumValues>
    <name>ИспользуетсяВОЭЗКалининградскойОбласти</name>
  </enumValues>
  <enumValues>
    <name>НаходитсяНаТерриторииДругогоГосударства</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/НалоговаяБазаПоНалогуНаИмущество/НалоговаяБазаПоНалогуНаИмущество.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НалоговаяБазаПоНалогуНаИмущество</name>
  <enumValues>
    <name>СреднегодоваяСтоимость</name>
  </enumValues>
  <enumValues>
    <name>КадастроваяСтоимость</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/InformationRegisters/СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам/ManagerModule.bsl
// Процедура заполняет новый реквизит "Вид имущества"
//
Процедура ЗаполнитьВидИмущества() Экспорт
	
	НаборЗаписей = РегистрыСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	ТекстСообщения = "Не удалось установить виды имущества для объектов";
	Для каждого СтрокаНабора Из НаборЗаписей Цикл
		Если СтрокаНабора.УдалитьВходитВСоставЕСГС Тогда
			СтрокаНабора.ВидИмущества = Перечисления.ВидыИмущества.ВходитВСоставЕСГС;
			ВидИмущества = "Входит в состав единой системы газоснабжения (ЕСГС)";
		Иначе
			СтрокаНабора.ВидИмущества = Перечисления.ВидыИмущества.ОсобенностиОтсутствуют;
			ВидИмущества = "Особенности отсутствуют";
		КонецЕсли;
		
		ТекстСообщения = ТекстСообщения + "
			|" + СтрокаНабора.ОсновноеСредство + " - " + ВидИмущества;
		
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		ttk_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

// Процедура заполняет новый реквизит "Налоговая база"
//
Процедура ЗаполнитьПорядокОпределенияНалоговойБазы() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.НалоговаяБаза
	|ИЗ
	|	РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам
	|ГДЕ
	|	СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.НалоговаяБазаПоНалогуНаИмущество.ПустаяСсылка)";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
	
		НаборЗаписей = РегистрыСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		
		Для каждого Запись Из НаборЗаписей Цикл
			
			Если НЕ ЗначениеЗаполнено(Запись.НалоговаяБаза) Тогда
				Запись.НалоговаяБаза = Перечисления.НалоговаяБазаПоНалогуНаИмущество.СреднегодоваяСтоимость;
			КонецЕсли;
			
		КонецЦикла;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ТекстСообщения	= НСтр("ru = 'Не выполнено обновление записей регистра сведений ""Ставки налога на имущество по отдельным основным средствам""'");
			ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЕсли;
		
КонецПроцедуры
